# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = [1, 2, 3, 4, 5]
my_tuple = (1, 2, 3, 4, 5)
my_set = {1, 2, 3, 4, 5}
my_dict = {1: '1', 2: '2', 3: '3', 4: '4', 5: '5'}
my_int = 1
my_float = 1.123
my_string = '12345'
my_bool = True

print ('My_list is ', type(my_list))
print ('My_tuple is ', type(my_tuple))
print ('My_set is ', type(my_set))
print ('My_dict is ', type(my_dict))
print ('My_int is ', type(my_int))
print ('My_float is ', type(my_float))
print ('My_string is ', type(my_string))
print ('My_bool is ', type(my_bool))